web-app/tests/load-test.yml
config:
  target: "https://app-084e0d55.web.app"
  phases:
    - duration: 20
      arrivalRate: 2
      name: Warm up
    - duration: 40
      arrivalRate: 2
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      name: Sustained load
  defaults:
    headers:
      User-Agent: "Artillery-Load-Test"

scenarios:
  - name: "Homepage and Login Flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/login"
      - think: 1
      - get:
          url: "/splash"